000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗаменаДисконтныхКарт/ЗаменаДисконтныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаменаДисконтныхКарт</name>
  <registerRecords>InformationRegister.РегистрацияЗаменыКартПокупателей</registerRecords>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КартыПокупателей</name>
    <attributes>
      <name>КартаИсточник</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КартаПриемник</name>
      <type>
        <types>CatalogRef.ИнформационныеКарты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <comment>Магазин, где была проведена выдача карты</comment>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Резерв</name>
    <comment>(Служ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ЗаменаДисконтныхКарт/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, Режим)

	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, Режим);
	//
	// Инициализация данных документа
	Документы.ЗаменаДисконтныхКарт.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	//
	// Движения по регистрации замены карт покупателей.
	МаркетинговыеАкцииСервер.ОтразитьРегистрацияЗаменыКартПокупателей(ДополнительныеСвойства, Движения, Отказ);
//	LNK 13.02.2019 11:38:20
	ВыполнитьОперацииПоДисконтнымКартам(Отказ);
	//
	СформироватьСписокРегистровДляКонтроля();
	//
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НайденнаяСтрокаНеЗаполненаИнформационнаяКарта = КартыПокупателей.Найти(Справочники.ИнформационныеКарты.ПустаяСсылка(), "КартаИсточник, КартаПриемник");
	Если НайденнаяСтрокаНеЗаполненаИнформационнаяКарта = Неопределено Тогда
		ПроверитьЗаполнениеТабличнойЧастиКартыПокупателей(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗаполнениеОбъектовСобытия.ОбщиеДействияПередЗаписью(ЭтотОбъект, Отказ);	//	LNK 20.08.2019 08:35:01

	ДополнительныеСвойства.Вставить("ЭтоНовый"   , ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("Проведен"   , ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Проведен", Ложь));

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);

КонецПроцедуры

// Процедура - обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение

// Инициализирует документ
//
Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Магазин = ПараметрыСеанса.ТекущийМагазин;

	Если Магазин.Пустая() Тогда

		Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Прочее

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

// Проверяет правильность заполнения табличной части "КартыПокупателей".
// Если какой-то из реквизитов, влияющих на проведение, не заполнен или
// заполнен некорректно, то устанавливается флаг отказа в проведении.
//
// Параметры:
//  ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа.
//  Отказ - флаг отказа в проведении.
//  Заголовок - заголовок сообщения об ошибках.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиКартыПокупателей(Отказ)
	
	Если Не Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.КартаИсточник,
		|	Таблица.НомерСтроки
		|ПОМЕСТИТЬ ТаблицаВЗапросе
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВЗапросе.КартаИсточник,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаВЗапросе.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ДублирующиесяОбъекты
		|ИЗ
		|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаВЗапросе.КартаИсточник
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаВЗапросе.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДублирующиесяОбъекты.КартаИсточник КАК КартаИсточник,
		|	ТаблицаВЗапросе.НомерСтроки
		|ИЗ
		|	ДублирующиесяОбъекты КАК ДублирующиесяОбъекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВЗапросе КАК ТаблицаВЗапросе
		|		ПО ДублирующиесяОбъекты.КартаИсточник = ТаблицаВЗапросе.КартаИсточник
		|ИТОГИ ПО
		|	КартаИсточник";
		
		Запрос.УстановитьПараметр("Таблица", КартыПокупателей.Выгрузить());
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаНомеровСтрок = Выборка.Выбрать();
			ТекстСообщенияСтроки = "";
			Пока ВыборкаНомеровСтрок.Следующий() Цикл
				ТекстСообщенияСтроки = ТекстСообщенияСтроки + ВыборкаНомеровСтрок.НомерСтроки + ", ";
			КонецЦикла;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для карты ""%1"" есть дублирование в строках №№ %2'"),
				Выборка.КартаИсточник,
				ТекстСообщенияСтроки
				
			);
			ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения)-2);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"КартыПокупателей",
				,
				Отказ
			);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.КартаИсточник,
		|	Таблица.КартаПриемник,
		|	Таблица.НомерСтроки
		|ПОМЕСТИТЬ ТаблицаВЗапросе
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаВЗапросе.НомерСтроки КАК НомерСтроки,
		|	ТаблицаВЗапросе.КартаИсточник
		|ИЗ
		|	ТаблицаВЗапросе КАК ТаблицаВЗапросе
		|ГДЕ
		|	ТаблицаВЗапросе.КартаИсточник = ТаблицаВЗапросе.КартаПриемник
		|	И (НЕ ТаблицаВЗапросе.КартаИсточник = ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка))";
		
		Запрос.УстановитьПараметр("Таблица", КартыПокупателей.Выгрузить());
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В строке № %1 в источнике и приемнике указана одинаковая карта ""%2""'"),
				Выборка.НомерСтроки,
				Выборка.КартаИсточник
			);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"КартыПокупателей[" + Строка(Выборка.НомерСтроки - 1) + "].КартаИсточник",
				,
				Отказ
			);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

//	LNK 13.02.2019 11:13:41
Процедура ВыполнитьОперацииПоДисконтнымКартам(Отказ)

	УстановитьПривилегированныйРежим(Истина);

	Для каждого СтрокаТаблицы Из ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНазначитьВладельцевКарт Цикл

		ВерификацияКлиентовСервер.УстановитьДанныеИнформационнойКарты(СтрокаТаблицы);

	КонецЦикла;

	Для каждого СтрокаТаблицы Из ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаБлокироватьИнформационныеКарты Цикл

		КартаОбъект = СтрокаТаблицы.ИнформационнаяКарта.ПолучитьОбъект();

		КартаОбъект.Блокирован   = Истина;
		КартаОбъект.ДатаЗакрытия = ТекущаяДата();

		КартаОбъект.ОбменДанными.Загрузка = Истина;
		КартаОбъект.Записать();

	КонецЦикла;

КонецПроцедуры
